cristobalgc/STM32_PID_CONTROLLER/PID_Regulator/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <string.h>
#include "stm32f1xx_hal.h"
#include <../ds1302/ds1302.h>
#include <../menu/menu.h>
#include "../pid/pid.h"

#include "../lcd/bigFont_lcdI2c.h"
#include "../lcd/lcd_Hd44780I2C.h"

#include "../sdbg/sdbg.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

#define LCD_ROWS		(4U)
#define LCD_COLS		(20U)
#define LCD_I2C_ADDRESS	(0x4E)

#define SAMPLING_TIME (4u)
#define KI (1)
#define KD (1)
#define KP (7u)
#define AD_RES (5000000/4096)
#define INITDUTYVAL (500u)
#define SET_POINT_INIT_VAL (4217u)

#define HOUR_FORMAT	(0) // 0 = 0-24h; 1= 0-12h
#define HOUR 		(15U)
#define MINUTES 	(10U)
#define SECONDS 	(10U)
#define AM_PM		(1U)
#define WEEKDAY 	(2U)
#define MONTHDAY 	(5U)
#define MONTH 		(4U)
#define YEAR 		(2021U)

#define HOUR_ALARM_FORMAT	(0U) // 0 = 0-24h; 1= 0-12h
#define HOUR_ALARM			(15U)
#define MINUTES_ALARM		(10U)
#define SECONDS_ALARM		(10U)
#define AM_PM_ALARM			(1U)
#define ALARM_STATUS		(0U)// OFF

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* Exported functions ------------------------------------------------------- */
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c1;

RTC_HandleTypeDef hrtc;

SPI_HandleTypeDef hspi1;

TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart1;
DMA_HandleTypeDef hdma_usart1_tx;
DMA_HandleTypeDef hdma_usart1_rx;

/* USER CODE BEGIN PV */

/* Number to print in the LCD */
static uint32_t encoderPos = 0;
/* Lcd object */
static LCD_t Lcd_2;
/* RTC object */
//static rtc_t Rtc; // Borrar
/* PID object */
static pidc_t Pid;
/* DS1302 object */
static ds1302_T rtc;
/* Menu object */
static menu_T menu;

static uint8_t flag_spi=0;

/*Pid configuration */
static const pid_cfg_t pidcfg = {
		KP,
		KI,
		KD,
		AD_RES,
		SAMPLING_TIME,
		INITDUTYVAL,
		SET_POINT_INIT_VAL
};

/* Pid configuration for menu */
static const menu_pidCfg_t menuPidCfg = {
		KP, KI, KD, SET_POINT_INIT_VAL
};

/* Clock configuration for menu */
static const menu_dateTimeCfg_t menu_dateTimeCfg ={
		HOUR_FORMAT, HOUR, MINUTES, SECONDS, AM_PM, WEEKDAY, MONTHDAY, MONTH, YEAR
};

/* Clock configuration for menu */
static const menu_alarmCfg_t menu_alarmCfg ={
		HOUR_ALARM_FORMAT, HOUR_ALARM, MINUTES_ALARM, SECONDS_ALARM, AM_PM_ALARM, ALARM_STATUS
};

/*Lcd configuration */
static const LCD_cfg_t Lcd_Hd44780I2cCfg =
{
	&hi2c1,   /* Depending on your active I2C configuration */
	LCD_COLS, /* Lcd columns */
	LCD_ROWS, /* Lcd rows */
	LCD_I2C_ADDRESS, /* Lcd address. Depending on your PCF8574T expander board it could change. */
	LCD_5x8DOTS /* Pending to remove, here you can set 0*/
};

static ds1302_cfg_T ds1302_config = {
	&hspi1,
	{GPIOA, GPIO_PIN_4}
};

static const menu_item_T menu1_cfg_options[6]={
        {0, menu_op1, menu_op1_sel, menu_PidSelected},
		{1, menu_op2, menu_op2_sel, menu_HourSelected},
		{2, menu_op3, menu_op3_sel, menu_enterPidOptions},
		{3, menu_op4, menu_op4_sel, menu_enterClockOptions},//
		{4, menu_op5, menu_op5_sel, menu_ChangePwmSelected},
		{5, menu_Exit, menu_Exit_sel, menu_ExitSelected},
};

/* MENU screen config */
static const menu_cfg_T menu1_cfg = {
		&Lcd_2,
		MENU_MAIN,
		MENU_SCREEN_NO_FREEZE,
		4,//max lines
		0,//line start
		5,//max options
		0,//min menu start option
		&menu1_cfg_options[0]
};

static const menu_item_T menu_defaultHourOptions[1]={
		{0, menu_empty, menu_empty, menu_defaultHourSel},
};

/* HOUR screen config */
static const menu_cfg_T menu_defaultHour = {
		&Lcd_2,
		MENU_DEFAULT_HOUR,
		MENU_SCREEN_NO_FREEZE,
		4,//max lines
		0,//line start
		0,//max options
		0,//min menu start option
		&menu_defaultHourOptions[0]
};

static const menu_item_T menu_defaultPidOptions[4]={
		{0, menu_defLine1Pid, menu_defLine1Pid, menu_defaultPidSel},
		{1, menu_defLine2Pid, menu_defLine2Pid, menu_defaultPidSel},
		{2, menu_defLine3Pid, menu_defLine3Pid, menu_defaultPidSel},
		{3, menu_defLine4Pid, menu_defLine4Pid, menu_defaultPidSel},
};

/* Pid screen config for PID*/
static const menu_cfg_T menu_defaultPid = {
		&Lcd_2,
		MENU_DEFAULT_PID,
		MENU_SCREEN_NO_FREEZE,
		4,
		0,
		3,
		0,
		&menu_defaultPidOptions[0]
};

static const menu_item_T menu_ChangePidSettingsOptions[11]={
		{0, submenu1_op1, submenu1_op1, NULL},
		{1, menu_empty, submenu1_op2, menu_ChangeKpEntireSel},
		{2, menu_empty, submenu1_op3, menu_ChangeKpDecimalSel},
		{3, menu_empty, submenu1_op4, menu_ChangeKiEntireSel},
		{4, menu_empty, submenu1_op5, menu_ChangeKiDecimalSel},
		{5, menu_empty, submenu1_op6, menu_ChangeKdEntireSel},
		{6, menu_empty, submenu1_op7, menu_ChangeKdDecimalSel},
		{7, menu_empty, submenu1_op8, menu_ChangeSetPointEntireSel},
		{8, menu_empty, submenu1_op9, menu_ChangeSetPointDecimalSel},
		{9, menu_empty, submenu1_op10, menu_ExitAndSavePid},
		{10, menu_empty, submenu1_op11, menu_exitAndNoSavePid},
};

/* Screen to Change PID settings*/
static const menu_cfg_T menu_ChangePidSettings = {
		&Lcd_2,
		MENU_PID_SETTINGS,
		MENU_SCREEN_NO_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		10,// number of menu items
		1, //min menu start option
		&menu_ChangePidSettingsOptions[0]
};

static const menu_item_T menu_ChangeDateTimeOptions[12]={
		{0, submenu3_op1, submenu3_op1, NULL},
		{1, menu_empty, submenu3_op2, menu_ChangeHourFormatSel},
		{2, menu_empty, submenu3_op6, menu_ChangeAmPmSel},
		{3, menu_empty, submenu3_op3, menu_ChangeHourSel},
		{4, menu_empty, submenu3_op4, menu_ChangeMinSel},
		{5, menu_empty, submenu3_op5, menu_ChangeSecSel},
		{6, menu_empty, submenu3_op7, menu_ChangeWeekDaySel},
		{7, menu_empty, submenu3_op8, menu_ChangeMonthDaySel},
		{8, menu_empty, submenu3_op9, menu_ChangeMonthSel},
		{9, menu_empty, submenu3_op10, menu_ChangeYearSel},
		{10, menu_empty, submenu3_op11, menu_exitAndSaveDateTime},
		{11, menu_empty, submenu3_op12, menu_exitAndNoSaveDateTime},
};

/* Screen to Change Hours*/
static const menu_cfg_T menu_ChangeDateTime = {
		&Lcd_2,
		MENU_CLOCK_SETTINGS,
		MENU_SCREEN_NO_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		11,// number of menu items
		1, //min menu start option
		&menu_ChangeDateTimeOptions[0]
};

static const menu_item_T menu_changeHourFormatOptions[1]={
		{0, menu_empty, menu_empty, menu_exitChangeClockSelected},
};

/* Screen to Change Hour format */
static const menu_cfg_T menu_changeHourFormat = {
		&Lcd_2,
		MENU_CHANGE_HOUR_FORMAT,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		1,// number of menu items
		0, //min menu start option
		&menu_changeHourFormatOptions[0]
};

static const menu_item_T menu_changeHourAmPmOptions[1]={
		{0, menu_empty, menu_empty, menu_exitChangeClockSelected},
};

/* Screen to Change Hour mode */
static const  menu_cfg_T menu_changeHourAmPm = {
		&Lcd_2,
		MENU_CHANGE_HOUR_AM_PM,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		1,// number of menu items
		0, //min menu start option
		&menu_changeHourAmPmOptions[0]
};

static const menu_item_T menu_changeHoursOptions[1]={
		{0, menu_empty, menu_empty, menu_exitChangeClockSelected},
};

/* Screen to Change Hours */
static const menu_cfg_T menu_changeHours = {
		&Lcd_2,
		MENU_CHANGE_HOUR,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		23,// number of menu items
		0, //min menu start option
		&menu_changeHoursOptions[0]
};

static const menu_item_T menu_changeMinutesOptions[1]={
		{0, menu_empty, menu_empty, menu_exitChangeClockSelected},
};

/* Screen to Change Minutes */
static const menu_cfg_T menu_changeMinutes = {
		&Lcd_2,
		MENU_CHANGE_MINUTES,
		MENU_SCREEN_FREEZE,
		1, // Used Lines to print the menu
		1, // Print the entire menu rotating on this line
		59,// number of menu items
		0, //min menu start option
		&menu_changeMinutesOptions[0]
};


